Revit 2027 API
RebarFreeFormAccessor.AddUpdatingSharedParameter Method
 Add existing shared parameter as a dependency for the calculation of the rebar curves.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddUpdatingSharedParameter(
	ElementId parameterId
)
Public Sub AddUpdatingSharedParameter (
	parameterId As ElementId
)
public:
void AddUpdatingSharedParameter(
	ElementId^ parameterId
)
member AddUpdatingSharedParameter :
        parameterId : ElementId -> unit
Parameters
parameterId ElementId
 ElementId of the shared parameter to be added.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. -or- parameterId is a parameter that is not bound to the Rebar element category.
Remarks
The input parameter needs to be bound to the Rebar element
The rebar element needs to have a valid external server
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace